Table of Contents
 Interface IIdeaElement1D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
An element is a part of a member. Every member is comprised of one or more elements. It's geometry is defined by a Segment that can be either a line or an arc. It must specify cross-sections at both ends.
public interface IIdeaElement1D : IIdeaObjectWithResults, IIdeaObject
Inherited Members
 IIdeaObjectWithResults.GetResults()
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 EccentricityBegin
Eccentricity (offset) at the start of the element. It is defined in the global coordinate system.
IdeaVector3D EccentricityBegin { get; }
Property Value
IdeaVector3D
 EccentricityEnd
Eccentricity (offset) at the end of the element. It is defined in the global coordinate system.
IdeaVector3D EccentricityEnd { get; }
Property Value
IdeaVector3D
 EndCrossSection
Cross-section at the and of the element.
IIdeaCrossSection EndCrossSection { get; }
Property Value
IIdeaCrossSection
 RotationRx
Rotation of the element around the x-axis of the Segment's LCS.
double RotationRx { get; }
Property Value
double
 Segment
Returns the segment object that should implement either IIdeaLineSegment3D or IIdeaArcSegment3D. Must not return null.
Hint: use is-operator to determine the segment type.
IIdeaSegment3D Segment { get; }
Property Value
IIdeaSegment3D
 StartCrossSection
Cross-section at the start of the element.
IIdeaCrossSection StartCrossSection { get; }
Property Value
IIdeaCrossSection
 Edit this page